<template>
	<div id="regAgreement">
		<div v-title>注册协议</div>
		<div style="width:100%;height:100%;overflow-x:hidden; overflow-y:auto;">
			<h4>E都市钱包注册协议</h4>
			<p style="text-indent: 2em;">E都市钱包注册协议（以下简称本协议）由浙江楚橡信息科技有限公司（以下简称本公司）和您签订。本协议在用户和E都市钱包间具有合同上的法律效力。请用户认真阅读、充分理解本协议各条款，特别是其中所涉及的免除、减轻E都市钱包责任的条款、对用户权利限制条款、争议解决和法律适用等。</p>
			<h3>一、声明与承诺</h3>
			<p style="text-indent: 2em;">（一）在接受本协议或您以本公司允许的其他方式实际使用E都市钱包服务之前，请您仔细阅读本协议的全部内容。如果您不同意本协议的任意内容，或者无法准确理解本公司对条款的解释，请不要进行后续操作，包括但不限于不要接受本协议，不使用本服务。如果您对本协议的条款有疑问，请通过本公司客服渠道进行询问,本公司将向您解释条款内容。<br> （二）如本公司需要对本协议进行变更或修改的，须通过网站公告的方式提前予以公布，公告期限届满后即时生效；若您在本协议内容公告变更生效后继续使用E都市钱包服务的，表示您已充分阅读、理解并接受变更后的协议内容，也将遵循变更后的协议内容使用E都市钱包服务；若您不同意变更后的协议内容，您应在变更生效前停止使用E都市钱包服务。<br> （三）如您为无民事行为能力人或为限制民事行为能力人，例如您未满18周岁，则您应在监护人监护、指导下阅读本协议和使用本服务。若您非自然人，则您确认，在您取得E都市钱包账户时，或您以其他本公司允许的方式实际使用E都市钱包服务时，您为在中国大陆地区合法设立并开展经营活动或其他业务的法人或其他组织，且您订立并履行本协议不受您所属、所居住或开展经营活动或其他业务的国家或地区法律法规的排斥。不具备前述条件的，您应立即终止注册或停止使用E都市钱包服务。<br> （四）您在使用E都市钱包服务时，应自行判断交易对方是否具有完全民事行为能力并自行决定是否使用E都市钱包服务与对方进行交易，且您应自行承担与此相关的所有风险。 </p>

				
			<h3>二、E都市钱包账户注册相关</h3>
			<p style="text-indent: 2em;">除本协议另有规定或相关产品另有规则外，您须在本网站注册并取得本公司提供给您的E都市钱包账户，或在您于其他阿拉丁旗下网站完成E都市钱包登录名注册，取得E都市钱包账户，并且按照本公司要求提供相关信息完成激活后方可使用本服务。您需使用作为E都市钱包登录名的本人电子邮箱或手机号码，或者本公司允许的其它方式（例如通过扫描二维码、识别生物特征的方式）登录E都市钱包账户，并且您应当自行为E都市钱包账户设置密码。</p>
			<p style="text-indent: 2em;">您同意：<br>1、按照E都市钱包要求准确提供并在取得该账户后及时更新您正确、最新及完整的身份信息及相关资料。若本公司有合理理由怀疑您提供的身份信息及相关资料错误、不实、过时或不完整的，本公司有权暂停或终止向您提供部分或全部E都市钱包服务。本公司对此不承担任何责任，您将承担因此产生的任何直接或间接支出。若因国家法律法规、部门规章或监管机构的要求，本公司需要您补充提供任何相关资料时，如您不能及时配合提供，本公司有权暂停或终止向您提供部分或全部E都市钱包服务。<br>2、您应当准确提供并及时更新您提供的电子邮件地址、联系电话、联系地址、邮政编码等联系方式，以便本公司与您进行及时、有效联系。您应完全独自承担因通过这些联系方式无法与您取得联系而导致的您在使用本服务过程中遭受的任何损失或增加任何费用等不利后果。您理解并同意，您有义务保持您提供的联系方式的有效性，如有变更需要更新的，您应按本公司的要求进行操作。<br>3、您应及时更新资料（包括但不限于身份证、户口本、护照等证件或其他身份证明文件、联系方式、作为E都市钱包账户登录名的邮箱或手机号码、 与E都市钱包账户绑定的邮箱、手机号码等），否则E都市钱包有权将E都市钱包登录名、E都市钱包账户绑定的邮箱、手机号码开放给其他用户注册或使用。因您未及时更新资料导致的一切后果，均应由您自行承担，该后果包括但不限于导致 本服务无法提供或提供时发生任何错误、E都市钱包账户及该账户内余额被别人盗用，且您不得将此作为取消交易、拒绝付款的理由。<br>4、若您为个人用户, 您确认, 本公司有权在出现下列情形时要求核对您的有效身份证件或其他必要文件, 留存有效身份证件的彩色扫描件, 且完成本公司要求的相关身份认证。您应积极配合，否则本公司有权限制或停止向您提供部分或全部E都市钱包服务：<br>
			A.您使用E都市钱包服务买卖金融产品或服务的；<br>
			B.您购买我公司记名预付卡或办理记名预付卡充值的;<br>
			C.您购买不记名预付卡或通过不记名预付卡为E都市钱包账户单笔充值超过人民币1万元的;<br>
			D.您要求变更身份信息或您身份信息已过有效期的;<br>
			E.本公司认为您的交易行为或交易情况出现异常的;<br>
			F.本公司认为您的身份资料存在疑点或本公司在向您提供服务的过程中认为您已经提供的身份信息或相关资料存在疑点的;<br>
			G.本公司认为应核对或留存您身份证件或其他必要文件的其他情形的。<br>
			本条款所称“以上”,包括本数。<br> 5、您在E都市钱包账户中设置的昵称、头像等必须遵守法律法规、公序良俗、社会公德，且不会侵害其他第三方的合法权益，否则E都市钱包有权对您的E都市钱包账户采取限制措施，包括但不限于屏蔽、撤销您E都市钱包账户的昵称、头像，停止提供部分或全部E都市钱包服务。
			</p>
		</div>
	</div>
</template>

<script>
	import wxToapp from '../../../../common/wx/wxToapp'
	export default{
		mixins:[wxToapp],
		data(){
			return{

			}
		},
		components:{
			
		},
		created(){

		}
	}
</script>

<style lang="scss" scoped>
	#regAgreement{
		font-size:0.32rem;
		line-height:0.506667rem;
		background:#fff;
		color:#333;
		padding:0.266667rem;
		text-align:justify;
		p{
			font-size:0.346667rem;
			line-height:0.586667rem;
			padding:0.133333rem
		}
		h3{
			font-size:0.373333rem;
		}
		h4{
			font-size:0.4rem;
			line-height:0.64rem;
			text-align:center;
		}
	}
</style>