<template>
    <div id="addedService">
        <div class="bg"></div>
        <div class="xubox_layer">
            <div class="title">增值服务协议
                <div class="del reg" @click='addedServiceFalg'>
                    <i class="el-icon-close"></i>
                </div>
            </div>
            <div class="xubox_page">
                <div class="content">
                    <p>浙江楚橡信息科技有限公司（以下简称“平台”）依据本协议的规定为平台用户（以下简称“用户”、“您”）提供增值服务，本协议在用户和平台间具有法律效力。平台在此特别提醒您，在使用本平台提供的增值服务前，请审慎阅读本协议的全部条款，您在登陆平台过程中，点击类似“接受”按钮即视为您充分理解并同意接受本协议全部内容。</br>用户在此确认知悉并同意平台有权根据需要修改、增加或删减本协议。平台将采用在网页公告、App推送或其他方式通知用户该等修改、增加或删减的内容。一经平台公告，即视为上述内容已经通知到用户。若用户在本协议及各类规则变更后继续使用平台增值服务的，视为用户已仔细认真阅读、充分理解并同意接受修改后的增值服务协议及各类规则。平台保留中止、终止或限制用户继续使用平台增值服务的权利，但该等终止、中止或限制行为并不豁免用户已经进行的交易所应承担的责任和义务。</p>
                    <h3>一、定义</h3>
                    <p>如无特别说明，下列用语在本协议中的含义为：</p>
                    <p>1. 用户：在平台完成注册、拥有平台账户的用户，包括资金转出方和资金接收方。</p>
                    <p>2. 用户名：本平台用户注册所获得的登录账号。该用户名同时为用户使用平台增值服务的唯一身份账号。</p>
                    <p>3. 密码：指确认用户身份的字符与数字信息，由用户在注册时自行设置。</p>
                    <p>4. 平台账户：指由用户及平台的合作方通过平台在资金存管合作银行或第三方支付公司开设并用于记录用户资金使用情况的综合管理账户。</p>
                    <p>5. 增值服务：指用户通过平台账户接收他人转账款项的服务，属于转账服务的一部分。</p>
                    <p>6. 第三方支付：指根据中国法律法规成立，拥有非金融机构支付服务资质，为平台上的交易提供部分或全部货币资金转移服务。</p>
                    <h3>二、平台提供的转账服务</h3>
                    <p>1. 平台为用户提供转账服务，服务对象包括资金转出方和资金接收方，该项服务可能需要用户完成“交易密码确认”、 “短信验证码确认”、“签署协议”等操作，并提供相应的转账信息（包括但不限于资金转出方和接收方姓名、手机号、平台账户信息以及转出金额等），用户未完成该等操作和/或未提供相应的信息，将导致用户无法使用转账服务，由此造成的损失，平台不承担任何责任；资金接收方无需主动发起资金接收申请。</p>
                    <p>2. 平台为用户提供转账服务，具体内容如下：</p>
                    <p>1）资金划转：用户委托平台将用户平台账户里的款项支付给用户指定的其他方。</p>
                    <p>2）转账记录查询：平台将对用户在平台上的所有转账操作进行记录，不论该操作之目的最终是否实现。用户可以通过用户平台账户实时查询其名下的转账记录。用户理解并认可用户在平台进行的资金划转委托及相关转账交易记录，以资金存管合作银行系统、第三方支付机构等合作伙伴系统记录为准。用户通过平台查询的任何信息仅作为参考，不作为相关操作或交易的证据或依据。</p>
                    <p>3. 用户理解并同意，如用户使用转账服务，相关资金的划转将由与平台合作的资金存管银行、第三方支付公司实际完成。</p>
                    <p>4. 用户同意，平台有权在提供转账服务过程中以各种方式在平台页面上投放商业性广告或其他任何类型的商业信息，并且，用户同意接受平台通过短信、电子邮件或其他方式向用户发送商品促销或其他相关商业信息。</p>
                    <p>5. 用户理解并同意，用户自身操作失误、错误等造成损失的，平台不承担任何损失或责任。</p>
                    <p>6. 用户保证并承诺通过平台进行转账的资金来源合法。</p>
                    <h3>三、用户的权利与义务</h3>
                    <p>1. 用户应保证其提供的用户信息的真实、准确、完整、有效，如有变更，应及时通知平台并按照平台的要求办理变更手续。如用户未按照平台的规定提交相关真实、有效的信息，平台有合理的理由怀疑用户提交的信息为错误、虚假或不完整的，平台有权拒绝为用户提供转账服务，对此平台不承担任何责任。同时，因此所产生的任何直接或间接的支出、损失、费用、处罚将由用户承担。若由于用户未及时更新用户信息包括但不限于身份信息、银行账户信息、手机号码等，而导致平台转账服务无法提供或转账服务的有关流程及操作发生任何错误，用户不得以此为由任意取消转账交易、拒绝支付转账款项和转账服务手续费或采取其它不当行为，并将独立承担因此产生的所有责任和后果。</p>
                    <p>2. 用户不得通过平台发布违反法律、法规、政策或破坏性的信息，不得干扰平台系统的正常运作。</p>
                    <p>3. 用户应对与用户平台账户绑定的银行卡账户拥有合法的使用权，如用户因故对银行卡账号丧失使用权的，则平台可停止为用户提供转账服务，同时，用户可以其另外提供的有效银行卡账户变更绑定。</p>
                    <p>4. 用户应依照约定及时足额的向平台或与平台合作的资金存管银行、第三方支付服务费用（若有）。</p>
                    <p>5. 用户只享有资金转出或资金接收功能中的一种的，应当遵守本协议有关约定。</p>
                    <h3>四、平台的权利与义务</h3>
                    <p>1. 平台有权根据用户所提供资料的真实性、准确性、完整性、有效性以及是否符合平台规定的其他条件，决定是否向用户提供转账服务，包括是否提供转出或接收服务等。</p>
                    <p>2. 为实现用户资金转账，平台有权根据用户的委托进行基金赎回、债权转让等操作。</p>
                    <p>3. 平台有权基于单方独立判断，在其认为可能发生危害交易安全等情形时，不经通知而先行暂停、中断或终止向用户提供本协议项下的转账服务，且无需对用户或任何第三方承担任何责任。前述情形包括但不限于：</p>
                    <p>1）平台认为用户提供的资料不具有真实性、准确性、有效性或完整性；</p>
                    <p>2）平台发现异常交易，有违法违规或有疑义；</p>
                    <p>3）平台认为用户账户涉嫌洗钱、套现、传销、被冒用或平台认为有风险的情形；</p>
                    <p>4）平台认为用户已经违反本协议中规定的各类规则及原则；</p>
                    <p>5）用户在使用平台收费服务时未按规定向平台支付相应的服务费用；</p>
                    <p>6）用户平台账户已连续三年内未实际使用或账户中余额为零。</p>
                    <p>4. 平台有权基于交易安全等方面的考虑而设定涉及交易的相关事项，包括但不限于交易限额、交易次数等。</p>
                    <p>5. 用户存在恶意诋毁或损害平台声誉、攻击平台相关系统、利用平台用户身份从事违反国家法律法规活动等行为之一的，平台有权单方面终止用户的权利，并保留追究用户法律责任的权利。</p>
                    <h3>五、转账服务费用</h3>
                    <p>1. 当用户使用平台提供的转账服务时，平台会向用户收取相关平台转账服务费用。转账服务费用详见平台在平台所列之收费方式说明。平台保留单方面制定及调整转账服务费用的权利。</p>
                    <p>2. 用户在使用平台转账服务过程中可能需要向第三方机构（如银行或第三方支付公司等）支付一定的费用，具体收费标准详见资金存管合作银行或第三方支付公司网站相关页面，或平台的提示。用户与资金存管银行、第三方支付公司之间就费用支付事项产生的纠纷与平台无关。</p>
                    <h3>六、除外责任</h3>
                    <p>1. 因用户自身的原因导致的任何损失或责任，由用户自行负责，平台不承担任何责任。平台不承担责任的情形包括但不限于：</p>
                    <p>1）用户未按照本协议或平台公布的规则进行操作导致的任何损失或责任；</p>
                    <p>2）用户使用未经认证的银行卡或使用非用户本人的银行卡，用户的银行卡被冻结、挂失等导致的任何损失或责任；</p>
                    <p>3）用户平台账户及银行账户内余额不足导致的任何损失或责任。</p>
                    <p>2. 在任何情况下，对于用户使用涉及由第三方提供相关服务的责任由该第三方承担，平台不承担任何责任。该等情形包括但不限于：</p>
                    <p>1）因资金存管合作银行、第三方支付公司等第三方未按照用户和/或平台指令进行操作引起的任何损失或责任；</p>
                    <p>2）因资金存管合作银行、第三方支付公司等第三方原因导致资金未能及时到账而引起的任何损失或责任；</p>
                    <p>3）因资金存管合作银行、第三方支付公司等第三方对交易限额或次数限制而引起的任何损失或责任；</p>
                    <p>4）因其他第三方的行为或原因导致的任何损失或责任。</p>
                    <p>3. 平台上的转账服务可能涉及由第三方所有、控制或者运营的网站（以下简称“第三方网站”）。平台不能保证也没有义务保证第三方网站上任何信息的真实性和有效性。用户应按照第三方网站的服务协议使用第三方网站，而不是按照本协议。</p>
                    <p>4. 用户经由平台上的转账服务而使用、下载或取得任何资料，应由用户自行考量且自负风险，因资料的下载而导致的任何损坏由用户自行承担。</p>
                    <h3>七、隐私条款</h3>
                    <p>1. 平台尊重并保护所有使用平台转账服务用户的个人隐私。平台收集信息的范围仅限于平台认为了解用户的需求和开展业务所必需的相关资料，以给用户提供更准确、更有个性化的服务。平台将按照具体授权条款的规定收集、存储、保护、使用和共享用户的个人信息，这些具体授权条款将在用户使用平台转账服务的过程中以弹窗提醒、协议展示等方式呈现，用户应在使用转账服务前完整地阅读具体授权条款，以帮助用户了解维护自己隐私权的方式。</p>
                    <p>2. 用户在同意本协议或使用平台转账服务之时，即视为用户已同意平台按照具体授权条款来合法使用和保护用户的个人信息。</p>
                    <p>3. 平台将以高度的勤勉、审慎义务对待用户的个人信息，除本协议及具体授权条款约定外，在未征得用户事先许可的情况下，平台不会将用户个人信息对外披露或向第三方提供。</p>
                    <h3>八、责任范围及限制</h3>
                    <p>1. 平台仅对本协议中列明的范围内责任负责。</p>
                    <p>2. 因以下情况，平台没有正确执行或无法履行用户在平台提交的操作指令，平台不承担任何责任。</p>
                    <p>1）指令信息不明、存在乱码或不完整等；</p>
                    <p>2）用户所拥有的产品发生失效、过期、终止、作废等情况；</p>
                    <p>3）不可抗力或意外事件；</p>
                    <p>4）其它平台无过失的情况。</p>
                    <p>3. 用户须妥善保存用户名、密码，对用户保管不善造成的损失，平台不对此承担任何责任。用户亦不得以其密码等信息丢失否认已订立的合同的效力。</p>
                    <p>4. 如果用户因在第三方设备、移动通讯设备、公共共享环境或电脑被远程监控的情况下使用平台提供的转账服务而造成包括但不限于信息泄露、数据丢失以及财产损失的，平台不对此承担任何责任。</p>
                    <p>5. 如果用户将用户名或平台账户详细信息输入除平台安全登陆系统外的其它任何服务系统，而造成包括但不限于利润、商誉、使用、数据等方面的损失，平台不承担任何责任。</p>
                    <p>6. 如发生不可抗力事件、病毒、黑客攻击、第三方服务瑕疵、政府行为以及现有科学技术限制等原因导致的服务中断、数据丢失以及其它的损失和风险，不应视为平台违约，平台无需为此承担任何违约责任。</p>
                    <p>7. 平台转账服务不允许用户使用他人身份信息注册，否则，因此产生的法律责任将由用户本人承担。用户在平台添加第三人账户，须事先获得第三人同意。一旦输入正确的用户名和密码，平台即视用户的行为已获得第三人同意。平台不对用户或第三人因此产生的损失承担任何责任，并且如该项操作造成平台损失的，平台将保留追索的权利。</p>
                    <p>7. 平台转账服务不允许用户使用他人身份信息注册，否则，因此产生的法律责任将由用户本人承担。用户在平台添加第三人账户，须事先获得第三人同意。一旦输入正确的用户名和密码，平台即视用户的行为已获得第三人同意。平台不对用户或第三人因此产生的损失承担任何责任，并且如该项操作造成平台损失的，平台将保留追索的权利。</p>
                    <h3>九、风险提示</h3>
                    <p>1. 用户了解并认可，任何通过平台进行的交易并不能避免以下风险的产生，平台不能也没有义务为如下风险负责：</p>
                    <p>1）宏观经济风险：因宏观经济形势变化，可能引起价格等方面的异常波动，用户有可能遭受损失；</p>
                    <p>2）政策风险：有关法律、法规及相关政策、规则发生变化，可能引起价格等方面异常波动，用户有可能遭受损失；</p>
                    <p>3）违约风险：因其他交易方无力或无意愿按时足额履约，用户有可能遭受损失；</p>
                    <p>4）利率风险：市场利率变化可能对购买或持有产品的实际收益产生影响；</p>
                    <p>5）操作风险：任一方使用的计算机系统被第三方侵入、宕机，或火灾、恐怖攻击灾难发生等，用户有可能遭受损失。</p>
                    <p>6）因用户的过错导致的任何损失，该过错包括但不限于：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、用户委托他人代理交易时他人恶意或不当操作而造成的损失。</p>
                    <p>2. 平台不对任何用户及/或任何交易提供任何担保或条件，无论是明示、默示或法定的。平台不能也不试图对用户发布的信息进行控制，对该等信息，平台不承担任何形式的证明、鉴定服务。平台不能完全保证平台内容的真实性、充分性、可靠性、准确性、完整性和有效性，并且无需承担任何由此引起的法律责任。用户依赖于用户的独立判断进行交易，用户应对其作出的判断承担全部责任。</p>
                    <p>3. 以上并不能揭示用户通过平台所进行交易的全部风险及市场的全部情形。用户在做出交易决策前，应全面了解相关交易，谨慎决策，并自行承担全部风险。</p>
                    <h3>十、知识产权保护条款</h3>
                    <p>1.平台上提供的所有内容（包括但不限于文字、音频、视频、图片、图表、广告、平台向用户发送的电子邮件等）的知识产权归平台及相关权利人所有。</p>
                    <p>2.除另有声明外，平台提供平台转账服务时所依托的软件著作权和专利权归平台及相关权利人所有。</p>
                    <p>3.未经平台授权，用户不得以任何方式擅自修改、复制、存储、传送、抄袭、分发上述内容。</p>
                    <p>4.未经平台授权，用户不得将平台包含的任何内容用作商业或其它公开用途。任何未经平台授权对平台内容的使用均属于违法行为。</p>
                    <h3>十一、法律适用</h3>
                    <p>1. 本协议的订立、生效、履行、解释以及由此产生的所有事项均适用中华人民共和国法律。</p>
                    <p>2. 本协议中的部分条款无效，不影响其它条款的效力。若上述无效条款构成本协议经济目的之条款或核心条款，则该条款应被尽可能接近各方意图、能够保留本协议要求的经济目的且为有效的新条款所取代。在此情况下，本协议的其它条款仍然有效。</p>
                    <h3>十二、争议解决</h3>
                    <p>凡因履行本协议所引起的任何争议，双方同意首先以友好协商的方式解决。协商不成的，任一方均可将争议提交浙江楚橡信息科技有限公司所在地的杭州市滨江区人民法院管辖。</p>
                    <h3>十三、问题与投诉</h3>
                    <p>如果您对本协议有任何问题，请通过以下途径联系平台处理：</p>
                    <p>A. 客服QQ：3420355198（工作日 9:00-20:00）</p>
                    <p>B. 客服电话：4001353388（工作日 9:00-20:30 周末 9:00-17:30）</p>
                    <p style="margin-bottom:80px;">签订日期：&nbsp;&nbsp;
                        <span>{{year}}</span> 年
                        <span>{{month}}</span> 月
                        <span>{{day}}</span> 日</p>
                    </p>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    name: 'addedService',    // 登录框状态 
    data() {
        return {
            date: '',                // 当前的时间
            year: '',                // 当前的年份
            month: '',               // 当前的月份
            day: ''                  // 当前的日
        }
    },
    methods: {
        addedServiceFalg() {
            this.$emit('addedService', false);
        },
        initData() {
            this.date = new Date()
            this.year = this.date.getFullYear()
            this.month = this.date.getMonth() + 1
            this.day = this.date.getDate()
            if (this.month < 10) this.month = "0" + this.month
            if (this.day < 10) this.day = "0" + this.day
        }
    },
    mounted: function() {
        this.initData()
    },
}  
</script>

<style lang="scss">
#addedService {
    .bg {
        position: fixed;
        top: 0;
        right: 0;
        bottom: 0;
        left: 0;
        margin: auto;
        opacity: 0.6;
        background: #000;
        z-index: 100;
    }
    .xubox_layer {
        position: absolute;
        width: 820px;
        height: 600px;
        background-color: #fff;
        top: 0;
        left: 0;
        right: 0;
        bottom: 0;
        margin: auto;
        z-index: 200;
        border-radius: 5px;
        .title {
            width: 100%;
            height: 50px;
            border-radius: 5px;
            border-bottom: 1px solid #f2f2f2;
            background: #e7e7e7;
            font-size: 18px;
            line-height: 50px;
            padding-left: 20px;
            color: #ff6600;
            cursor: move;
            .del.reg {
                width: 50px;
                height: 50px;
                position: absolute;
                right: 0;
                top: 0;
                line-height: 50px;
                margin-right: 10px;
                cursor: pointer;
                text-align: center;
                color: #999;
                i.el-icon-close {
                    transition: transform .3s;
                }
            }
            .del:hover i.el-icon-close {
                transform: rotate(90deg);
            }
        }
        .xubox_page {
            padding: 10px;
            width: 100%;
            height: 550px;
            .content {
                padding: 0;
                line-height: 100px;
                overflow: hidden;
                overflow-y: auto;
                width: 100%;
                height: 530px;
                font-family: "Microsoft YaHei", "arial";
                h3 {
                    font-size: 14px;
                    font-weight: bold;
                    color: #666;
                    padding: 8px 10px 2px 10px;
                    line-height: 29px;
                }
                p {
                    line-height: 23px;
                    padding: 0 10px 2px 10px;
                    color: #666;
                    font-size: 14px;
                    text-align: justify;
                }
            }
        }
    }
}
</style>