
/*出借服务协议  又称为融资协议 */
<template>
    <div id="borrowing">
        <div class="bg"></div>
        <div class="xubox_layer">
            <div class="title">E都市钱包三方借款协议
                <div class="del reg" @click='borrowing'>
                    <i class="el-icon-close"></i>
                </div>
            </div>
            <div class="xubox_page">
                <div class="content">
                    <h3 align="center">借款协议</h3>
                    <p class="num" align="right">协议编号：<em></em></p>
                    <p class="first">甲方（借款人）：<em>爱上街借款用户（具体信息详见项目借款列表人）</em></p>
                    <p class="last">乙方（出借人）：<em></em></p>
                    <p class="id">身份证号码：<em> </em></p>
                    <p class="last">丙方：<em>浙江楚橡信息科技有限公司</em></p>
                    <h3>一、定义</h3>
                    <p>除非缔约方另有约定，本协议下列术语定义如下:</p>
                    <p>1.1 E都市钱包平台：指由浙江楚橡信息科技有限公司开发并运营的，向甲方和乙方提供投融资信息发布与管理、投融资交易管理、交易资金结算（由支付机构提供）等服务的网络借贷信息中介服务平台。</p>
                    <p>1.2甲方是具有完全民事权利能力和民事行为能力，能独立行使和承担本协议项下权利义务的自然人，是浙江阿拉丁电子商务股份有限公司旗下的APP及网站平台（以下统称为“爱上街”）的注册用户，有借款需求，并充分知晓民间借贷行为可能存在的各类风险。</p>
                    <p>1.3 乙方是具有完全民事权利能力和民事行为能力，能独立行使和承担本协议项下权利义务的自然人，是丙方旗下的APP及网站平台（以下统称为“E都市钱包”）的注册用户，愿意出借其合法取得的自有资金，并充分知晓民间借贷行为可能存在的各类风险。</p>
                    <p>1.4 丙方是注册地在中华人民共和国境内，依法成立并有效存续的一家有限公司，为甲、乙双方提供网络借贷信息中介服务，丙方有权收取居间服务费。</p>
                    <p>1.5 支付机构：指为E都市钱包平台用户提供交易资金结算等服务的机构。本协议项下提供前述服务的机构为新浪支付或浙商银行。</p>
                    <p>1.6 E都市钱包账户：指乙方申请注册的，以接受E都市钱包提供的查询、划转本协议项下款项等交易资金结算服务的账户。</p>
                    <p>1.7 借款总额：E都市钱包平台发布借款需求时所设定的借款金额。借款总额以E都市钱包平台具体展示及记录为准。</p>
                    <p class="last">1.8 指定账户：与履行本协议项下权利义务相关的账户，包括但不限于E都市钱包账户和银行结算账户两类账户类型。具体适用的账户类型视实际情况确定。</p>
                    <p style="text-indent: 2em;margin-bottom: 40px;">甲方是丙方战略合作伙伴 “爱上街”平台的注册用户，有借款需求，乙方是“E都市钱包”平台的注册用户，愿意出借其合法取得的自有资金，现由丙方居间撮合，乙方同意出借相应款项。经各方协商一致，现就上述借款事宜订立如下协议，以期共同遵守。</p>
                    <h3 style="margin-bottom: 50px;">二、借款基本信息</h3>
                    <div >
                    <table border="1" cellspacing="0" cellpadding="0" width="507" style="    margin: 0 auto;width: 80%; text-align: center;">
                            <tr>
                                    <td style="width: 30%">借款总金额</td>
                                    <td style="width: 70%">{{dataList.borrowAmount}}人民币</td>  
                                </tr>
                                <tr>
                                    <td>借款申请号</td>
                                    <td>{{dataList.borrowId}}</td> 
                                </tr>  
                                <tr>  
                                    <td>借款期限</td>
                                    <td v-if="dataList.borrowTimeType == 0">{{dataList.timeLimit}}个月</td>
                                    <td v-if="dataList.borrowTimeType == 1">{{dataList.timeLimit}}天</td>
                                </tr>  
                                <tr>  
                                    <td>借款期间</td>  
                                    <td></td> 
                                </tr>
                                <tr>  
                                    <td>借款利率</td>  
                                    <td>年利率 {{dataList.borrowApr}}%</td> 
                                </tr>
                                <tr>  
                                    <td>借款用途</td>  
                                    <td>消费借款</td> 
                                </tr>
                                <tr>  
                                    <td>还款方式</td>  
                                    <td>一次性还款</td> 
                                </tr>
                                <tr>  
                                    <td>出借金额</td>  
                                    <td></td> 
                                </tr>
                                <tr>  
                                    <td>出借申请号</td>  
                                    <td></td> 
                                </tr>  
                            </table>
                        </div> 
                    <h3>三、借款发放、还款方式及逾期还款</h3>
                    <p>3.1借款发放</p>
                    <p>3.1.1 甲乙双方对本协议所述借款相关信息全部认可，自主自愿依据本协议规定的内容，由乙方向甲方提供借款。</p>
                    <p>3.1.2 在本协议签署生效之日，基于甲方不可撤销的委托，乙方授权E都市钱包可将本协议约定的借款资金自乙方E都市钱包平台账户划转至甲方的指定账户时即视为乙方履行了放款义务。</p>
                    <p>3.1.3 乙方通过丙方将出借款项实际支付之日视为放款日，并从该日开始计息，且甲方不得以任何理由拒绝履行本协议项下的还款义务。</p>
                    <p class="last">3.1.4 甲方同意并授权丙方提前收取居间服务费（包含的服务内容：包括但不限于借款咨询、居间撮合、个人信用审核、通道服务、还款提醒、催收以及支付给第三方的服务费等）。</p>
                    <p>3.2还款方式</p>
                    <p>3.2.1甲方采用银行或乙方指定的第三方代扣方式还款。</p>
                    <p>3.2.2甲方还款账户以甲方在提出借款申请时绑定的银行卡为准，若甲方逾期还款，出借方有权通过其他方式扣划甲方任何款项。</p>
                    <p>3.2.3甲方保证以上账户信息中的身份及所提供的信息真实、有效、准确及合法，因甲方身份或所提供信息错误而引起的法律后果及损失，由甲方自行承担。</p>
                    <p>3.2.4甲、乙双方在此不可撤销地授权丙方及丙方指定第三方机构，在还款日24:00时前从甲方提出借款申请时绑定的银行账户将到期的款项及所有本合同项下到期的其他应付款项划扣至乙方账户，而无需进一步通知甲方或者得到其同意。</p>
                    <p>3.2.5若甲方还款账户发生变更的，甲方应最迟于账户变更后3个工作日内通知乙方并经乙方确认，授权划扣账户相应发生变更。除非甲方特别申明，甲方变更划扣账户的效力及于乙方与甲方签订的所有未结合同。</p>
                    <p>3.2.6无论因何种原因，如果银行或乙方指定的第三方代扣失败，甲方在本合同项下的还款义务并不减免，甲方应采用其它合理方式继续按期偿还。</p>
                    <p>3.2.7乙方理解并同意，最终将本协议项下的借款本息或受偿款项划转至乙方的E都市钱包账户需要一定的时间，前述时间一般为到期还款日后的1-3个工作日。</p>
                    <p class="last">3.2.8甲方应妥善保管本合同项下已还款项的付款证明。若发生争议，由甲方对其还款情况承担举证责任。</p>
                    <p>3.3逾期还款</p>
                    <p>3.3.1 如果甲方未按照本合同第二条借款信息约定的还款日履行还款义务，应立即偿还拖欠款项，并按规定支付违约金即逾期费用，乙方有权要求甲方立即偿还拖欠款项。</p>
                    <p>3.3.2甲方逾期还款的，自还款日后第1日起支付逾期管理费用。逾期费用计算方式如下： 每日逾期费用=当日逾期本金 x（ 日利率+手续费率+逾期手续费率）。</p>
                    <p>3.3.3 甲方逾期还款的，丙方以风险准备金垫付逾期欠款，丙方垫付逾期欠款后即有权向甲方追讨相关款项，具体垫付方式和额度以相关协议和平台规则为准。</p>
                    <p>3.3.4 还款顺序：甲方同意按下列顺序清偿债务：（1）乙方实现债权的费用；（2）逾期管理费用；（3）丙方的居间服务费；（4）利息；（5）本金。乙方有权根据甲方实际还款情况变更上述顺序。</p>
                    <p>3.3.5 任何一期逾期超过5日，或者累计逾期达到3次的，乙方授权丙方可以宣告借款提前到期，提前到期还款金额为全部未还本息及逾期管理费用。</p>
                    <h3>四、风险准备金垫付</h3>
                    <p>4.1 由丙方按照撮合金额比例设置一定金额的风险准备金；一旦甲方出现逾期还款的，由丙方通过风险准备金垫付本金及利息。</p>
                    <p>4.2 丙方进行垫付的，丙方从风险准备金账户提取垫付款项并将该款项支付至乙方及／或债权人受让人账户，丙方垫付后取得垫付部分借款金额及利息的追偿权，甲方没有异议。丙方追偿、催收上述偿付款项所产生的其他一切费用（包括但不限于评估鉴定费、差旅费、诉讼费、执行费、律师费等）由甲方承担。</p>
                    <p>4.3 甲方不可撤销地授权丙方在丙方向甲方追偿时将甲方账户（包括其银行及第三方支付账户）中的相应资金直接划扣至风险准备金账户。</p>
                    <h3>五、各方权利义务</h3>
                    <p>5.1 甲方的权利义务</p>
                    <p>5.1.11 协议各方同意，甲方逾期时，丙方在垫付并进行债权转让后，以债权受让方的名义进行催收；甲方知悉该情况并无异议，不得以任何理由拒绝还款。</p>
                    <p>5.1.2 甲方承诺所借款项仅用于个人消费，不得用于任何其他用途。</p>
                    <p>5.1.3甲方同意以网络页面点击确认或其他方式（包括但不限于签字或签章确认等方式）签订本协议，并不以此为由拒绝履行本协议项下的义务，即便在签订时本协议并没有乙方的信息、第二条及第五条的相关信息、签订日期信息等。甲方同意以上述方式签订本协议后即视为不可撤销及变更地授权E都市钱包平台根据最终撮合结果自主生成前述信息，且未经E都市钱包及乙方的同意，甲方不得否认本协议项下债权债务关系或以任何方式撤回、撤销本协议。</p>
                    <p>5.1.4甲方同意乙方委托E都市钱包根据本协议约定将借款金额划转至甲方的指定账户即视为乙方已履行完毕放款义务。</p>
                    <p>5.1.5甲方应保证其指定账户状态正常，确保资金划入、划出交易的完成。如因前述指定账户不正常导致的所有损失（如借款资金无法及时入账、还款资金无法划转等）应由其自行承担。</p>
                    <p>5.1.6甲方陈述并保证：甲方为申请借款而提供的所有信息完整、真实、准确，不存在误导性；甲方保证不存在任何正在进行的或潜在的可能影响甲方信用的情形，如涉及甲方的诉讼、仲裁、行政处罚等；因以上任何陈述不真实、不准确而导致的本协议各方的任何损失，均由甲方足额赔偿。</p>
                    <p>5.1.7甲方同意并授权乙方有权使用其自行收集或甲方提供的甲方资料及信息（包括但不限于本人个人信息及包括信贷信息在内的正常信用信息、不良信用信息等）用于包括但不限于以下用途：（1）为核实甲方的身份、资料和信息的真实性，向相关的个人、企事业单位、征信机构、国家机关进行必要的验证；（2）为了提供本协议项下的服务，向有关合作机构、征信机构提供必要之资料；（3）用于催收、解决争议、调停纠纷等；（4）根据监管部门的要求提供甲方相关信息等。</p>
                    <p>5.1.8甲方同意E都市钱包有权向甲方发送与本协议内容有关的信息及通知，包括但不限于放款通知、还款提醒及逾期催收等信息，发送方式包括但不限于电话、短信、邮寄、传真等。</p>
                    <p>5.1.9在乙方的债权转让后，甲方应按照本协议和债权转让协议的约定向债权受让人支付每期应还借款本息，不得拒绝履行还款义务。</p>
                    <p>5.1.10甲方不得将本协议项下的任何权利义务转让给任何其他方。</p>
                    <p>5.1.11 协议各方同意，甲方逾期时，乙方可授权第三方机构以乙方的名义进行催收；甲方知悉该情况并无异议，不得以任何理由拒绝还款。</p>
                    <p>5.1.12 甲方不可撤销地同意，如果甲方违约，乙方（或者其授权的第三方）直接或者经由可能认识甲方的第三方，就该违约事件通过当面拜访、电话、邮寄、短信、网络等合法形式，提醒或督促甲方改正违约行为，并且同意乙方向该第三方披露此违约事件。</p>
                    <p>5.1.13 甲方在申请借款时，向乙方提供的信息发生任何变化、甲方个人资产或者财务状况发生重大变化、或者发生了可能影响甲方履行本合同项下义务的任何其他情况时，甲方均应在五日内通知乙方。如因未能遵守上述承诺而导致的损失，由甲方自行承担。</p>
                    <p>5.1.14 甲方应当妥善保管个人账号、密码以及其他交易信息，凡使用甲方账号密码进行的交易均视为甲方本人所为，甲方应承担因账号密码保管不善（包括但不限于被盗用等）造成的风险损失。甲方应确保在安全的信息网络环境下进行交易，对于非乙方原因导致的信息网络交易风险和损失，甲方应自行承担责任。</p>
                    <p class="last">5.1.15 甲不会利用丙方平台进行信用卡套现、洗钱、非法集资或其他不正当交易行为，否则应依法独立承担法律责任。</p>
                    <p>5.2 乙方的权利义务</p>
                    <p>5.2.1乙方承诺向E都市钱包提供的信息及时、合法、真实、有效，保证其所用于出借的自有资金来源合法，乙方是该资金的合法所有人。</p>
                    <p>5.2.2乙方同意以网络页面点击确认的方式签订本协议，并不以此为由拒绝履行本协议项下的义务，即便在签订时本协议并没有甲方的信息、第二条及第五条的相关信息、签订日期信息等。出借人同意以前述方式签订本协议后即视为不可撤销及变更地授权E都市钱包平台根据最终撮合结果自主生成前述信息，且未经E都市钱包及甲方的同意，乙方不得否认本协议项下债权债务关系或以任何方式撤回、撤销本协议。</p>
                    <p>5.2.3乙方理解并同意，乙方通过丙方将出借款项实际支付之日视为放款日，并从该日开始计息，乙方有权从丙方处获得借款期间内基于借款金额的约定利息收益。</p>
                    <p>5.2.3乙方理解并同意，借款金额从其E都市钱包账户划转之日起至起息日（不含）的这段期间内不产生任何收益（包括但不限于利息）。乙方有权从甲方处获得借款期间内基于借款金额的约定利息收益。</p>
                    <p>5.2.5甲方同意，乙方可以根据自己的意愿进行本协议下其对甲方债权/或部分债权的转让。该债权转让给第三方后，由债权受让人承继本协议下全部或部分权利和义务。</p>
                    <p>5.2.6借款到期后，乙方同意并授权E都市钱包根据本协议约定将借款本金及利息划转至其E都市钱包账户即视为甲方已履行还款义务。</p>
                    <p>5.2.7 乙方应保证其E都市钱包账户状态正常，确保资金划入、划出交易的完成。</p>
                    <p>5.2.8 乙方理解并同意，E都市钱包不承担本协议项下乙方的任何资金损失风险，但因E都市钱包原因导致乙方资金损失的除外。</p>
                    <p>5.2.9乙方将其在本合同项下所有权利授权委托丙方或丙方认可的第三方行使，甲方同意并认可上述授权行为。</p>
                    <p class="last">5.2.10乙不会利用丙方平台进行信用卡套现、洗钱、非法集资或其他不正当交易行为，否则应依法独立承担法律责任。</p>
                    <p>5.3 丙方的权利和义务</p>
                    <p>5.3.1丙方为甲乙双方提供居间服务，有权收取相应居间服务费。</p>
                    <p>5.3.2甲乙双方均认可丙方后台出具的相关结算数据，同时授权丙方委托第三方支付公司或银行存管进行资金结算。</p>
                    <p class="last">5.3.3甲方双方均认可丙方与第三方的合作，并同意支付相关费用。</p>
                    <h3>六、协议的签订、成立及生效</h3>
                    <p>6.1 乙方和甲方签订本协议的方式包括但不限于：</p>
                    <p>6.1.1 通过E都市钱包平台、爱上街平台页面点击确认本协议；</p>
                    <p>6.1.2 委托E都市钱包代为确认本协议；</p>
                    <p>6.1.3 经E都市钱包认可的其他方式(包括但不限于签字或签章确认等方式)确认本协议。</p>
                    <p>6.2 本协议自乙方或甲方签订本协议之日（以两者孰后签订时间为准）成立。</p>
                    <p>6.3 本协议为附条件生效协议，协议生效需同时满足如下条件：</p>
                    <p>6.3.1 本协议已成立；</p>
                    <p>6.3.2 甲方设定的借款项目在募集完成；</p>
                    <p>6.3.3 E都市钱包平台根据最终撮合结果生成乙方与甲方信息、第二条信息及协议签订日期信息等要素，且本协议可在E都市钱包平台查询。</p>
                    <p>6.4 本协议生效后，E都市钱包会将本协议对应的借款金额从乙方的E都市钱包账户划转至甲方的指定账户。</p>
                    <p>6.5 本协议未生效的，E都市钱包平台将不会通知E都市钱包从乙方的E都市钱包账户扣划相应的借款金额；如已划转的，划转的款项将由E都市钱包按原路退回至乙方的E都市钱包账户。</p>
                    <p>6.6 本协议采用电子文本形式制成，并保存在丙方为此设立的专用服务器上备查，各方均认可该形式的协议效力并同意以此作为本协议有关事项的终局证明。</p>
                    <p>6.7 甲乙双方委托丙方对相关金额进行计算，并在丙方平台发布或更新具体信息。上述还款明细中列明的每月还款本息金额若与发布或更新的还款明细不一致的，以平台上发布或更新的还款明细为准。 </p>
                    <h3>七、其他事项</h3>
                    <p>7.1 甲方须确保到期后一次性足额偿还包括本协议借款金额在内的借款总额项下所有协议项下的借款本息及其他应付款项，否则不视为还款完成，由此引起的法律后果及违约责任由甲方承担。</p>
                    <p>7.2 乙方及甲方必须通过本协议约定的方式或其他E都市钱包认可的方式进行放款及还款,否则由此引起的法律后果及违约责任由乙方或甲方自行承担。</p>
                    <p>7.3 本协议项下借款记录等信息均以E都市钱包平台生成并公布的内容为准。本协议任何一方可以通过E都市钱包账户登录E都市钱包平台查询上述信息。</p>
                    <p>7.4 本协议项下的债权债务未经E都市钱包书面同意不得转让。</p>
                    <p>7.5若甲方设定的借款项目在丙方平台开始募集之日起7个工作日内未完成，丙方会于第7个工作日23：59后手动标满，即将借款金额同步为乙方已出借的金额，该部分金额对应债权形成，本协议生效且各方认可丙方行为。</p>
                    <p>7.6 协议各方应对其他方提供的信息及本协议内容保密，未经其他方同意，任何一方不得向协议主体之外的任何人披露，但法律、行政法规另有强制性规定，或监管、审计等有权机关另有强制性要求的除外。</p>
                    <p>7.7 协议各方知悉并遵守E都市钱包平台制定的相关规则的规定。</p>
                    <p>7.8如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，则应认为该条款可与本协议相分割，并可被尽可能接近各方意图的、能够保留本协议要求的经济目的的、有效的新条款所取代，而且在此情况下，本协议的其他条款仍然完全有效并具有约束力。</p>
                    <p>7.9 协议各方应按法律法规及相关规定各自承担与本协议相关的税费。</p>
                    <h3>八、 法律的适用和争议的解决</h3>
                    <p>本协议受中华人民共和国法律管辖并按中华人民共和国法律解释。协议履行中发生争议，可由各方协商解决，协商不成可向丙方所在地人民法院起诉。</p>
                    <p style="margin-bottom: 40px;">败诉方应承担对方为解决本争议而产生的所有费用，包括但不限于诉讼费、保全费及保全担保费、律师费、公证费、交通费等。</p>
                    <p>乙方签订日期： <em>{{dataList.investDate+''|divisionTime}}</em></p>
                    <p>甲方签订日期： <em>{{dataList.borrowDate+''|divisionTime}}</em></p>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    name: 'borrowing',    // 登录框状态 
    props:['uuid'],
    data() {
        return {
            dataList:{}
        }
    },
    methods: {
        borrowing() {
            this.$emit('borrowing', false);
        },
        initData() {
            let _this = this
            global.http.post_(_this, '/protocol/loan', {uuid:_this.uuid}, function(res) {
                if (res.body.resCode == 1) {
                   _this.dataList = res.body.resData
                } else {
                    _this.$message({ message: res.body.resMsg, type: 'warning' });
                }
            })
        }
    },
    mounted: function() {
        this.initData()
    }
}  
</script>

<style lang="scss">
#borrowing {
    .bg {
        position: fixed;
        top: 0;
        right: 0;
        bottom: 0;
        left: 0;
        margin: auto;
        opacity: 0.6;
        background: #000;
        z-index: 1000000000000;
    }
    .xubox_layer {
        position: absolute;
        width: 820px;
        height: 600px;
        background-color: #fff;
        top: 0;
        left: 0;
        right: 0;
        bottom: 0;
        margin: auto;
        z-index: 9999999999;
        border-radius: 5px;
        .title {
            width: 100%;
            height: 50px;
            border-radius: 5px;
            border-bottom: 1px solid #f2f2f2;
            background: #e7e7e7;
            font-size: 18px;
            line-height: 50px;
            padding-left: 20px;
            color: #ff6600;
            cursor: move;
            .del.reg {
                width: 50px;
                height: 50px;
                position: absolute;
                right: 0;
                top: 0;
                line-height: 50px;
                margin-right: 10px;
                cursor: pointer;
                text-align: center;
                color: #999;
                i.el-icon-close {
                    transition: transform .3s;
                }
            }
            .del:hover i.el-icon-close {
                transform: rotate(90deg);
            }
        }
        .xubox_page {
            padding: 10px;
            width: 100%;
            height: 550px;
            .content {
                padding: 0;
                line-height: 100px;
                overflow: hidden;
                overflow-y: auto;
                width: 100%;
                height: 530px;
                font-family: "Microsoft YaHei", "arial";
                h3 {
                    font-size: 16px;
                    font-weight: bold;
                    color: #666;
                    padding: 8px 10px 2px 10px;
                    line-height: 29px;
                    text-indent: 32px;
                }
                p {
                    line-height: 23px;
                    padding: 0 10px 2px 10px;
                    color: #666;
                    font-size: 16px;
                    text-align: justify;
                    text-indent: 32px;
                    em {
                        background: rgb(255, 255, 0);
                    }
                }
            }
        }
    }
}
</style>