<template>
    <div id="Investment">
        <div class="bg"></div>
        <div class="xubox_layer">
            <div class="title">出借服务协议
                <div class="del reg" @click='InvestmentFalg'>
                    <i class="el-icon-close"></i>
                </div>
            </div>
            <div class="xubox_page">
                <div class="content">
                    <p>本协议是关于您（下称“甲方”）在使用E都市钱包（下称“乙方平台”）出借服务时，约定您和浙江楚橡信息科技有限公司（以下简称“乙方”）之间权利义务关系的有效协议。您通过网络页面点击确认或以其他方式选择接受本协议，即表示您与楚橡已达成本协议并同意接受本协议的全部约定内容以及与本协议有关的各项规则及楚橡平台所包含的其他与本协议或本协议项下各项规则的条款和条件有关的各项规定。您应自行判断是否使用楚橡提供的出借服务，楚橡不对该出借服务的收益作出任何明示或暗示的保证和承诺，亦不对此承担任何连带责任。若您不同意本协议的全部或部分内容，请勿进行后续操作。</p>
                    <h3>一、概念与释义</h3>
                    <p>（一）乙方平台：指乙方运行的“E都市钱包”APP。</p>
                    <p>（二）存钱罐：指甲方通过乙方平台进行的汇添富基金管理有限公司（以下简称“汇添富”）货币基金的申购、赎回等相关业务，甲方的存钱罐账户为其货币基金资产情况。</p>
                    <p>（三）E起赚：指乙方根据甲方的委托，利用存钱罐账户资产为甲方购买乙方或乙方合作机构发布的网络借贷信息中介服务产品的业务，甲方的E起赚账户为其出借的资产情况。</p>
                    <p>（四）充值：甲方利用乙方的平台，自主选择通过银联卡等方式向存钱罐账户充值。</p>
                    <p>（五）智能出借服务（以下简称“智能出借”）：甲方委托乙方在满足条件时，由乙方或其委托的第三方在乙方平台通过线上操作使用甲方存钱罐账户中资产认购E起赚出借的服务。</p>
                    <h3>二、声明与承诺</h3>
                    <p>（一）甲方在签订本协议之前，已经仔细阅读了本协议的全部内容，就相关疑问向客服进行询问，并且未对任意内容存在无法理解或是不同意的情况，一经签订本协议，视为乙方已经履行了足够的告知义务。</p>
                    <p>（二）甲乙双方在诚实、平等、信用的基础上签订本协议，就本协议项下所有条款的表述、说明、规范达成一致意见。</p>
                    <p>（三）甲方同意，如乙方对协议进行变更或是修改的，可以通过乙方平台告知，如甲方未做异议表示或停止使用操作，则视为甲方同意修改后的协议内容。</p>
                    <p>（四）甲方通过使用“E都市钱包”APP点击确认或以其他方式选择接受本协议，即表示：</p>
                    <p>1、甲方与乙方已签署本协议并同意接受本协议的全部约定内容。</p>
                    <p>2、双方均同意本协议有关的各项规则及乙方平台所包含的其他与本协议或本协议项下各项规则的条款和条件有关的其他协议和各项规定及其可能发生的变更。</p>
                    <p>（五）乙方仅向甲方提供操作平台、出借渠道和咨询服务，除甲乙双方另行约定或本协议明确阐述外，均由甲方与出借项目涉及的其他主体签订相关协议，开展相关业务。</p>
                    <h3>三、服务内容与双方权利义务</h3>
                    <p>（一）多渠道充值服务</p>
                    <p>1.甲方将银行卡等帐户的资金划入乙方相应账户，并不可撤销的委托乙方或乙方合作的资金存管银行、第三方支付机构将对应资金充值至甲方的存钱罐账户。</p>
                    <p>2.甲方确保银联卡账户真实、合法、准确、有效，均为且仅为本人独有的账户。</p>
                    <p>3.甲方仅可以向本人独有的存钱罐账户充值。</p>
                    <p>4.乙方会对甲方可能存在的各类应用及账户进行真实身份验证，但对此验证不做任何保证；因甲方过错如登记信息有误等给乙方或任意第三方造成的损失，由甲方承担。</p>
                    <p>（二）网络借贷信息中介服务</p>
                    <p>1.甲方理解并认可，当甲方同意本协议后，甲方即不可撤销地委托乙方在满足以下条件时将甲方存钱罐账户中资产用于出借E起赚网络借贷信息中介服务产品。</p>
                    <p（1）其他用户在线上发布借贷申请，且甲方在排队机制中处于队伍最前端时，乙方即将代理甲方智能出借，根据甲方对应的乙方平台内部计算数值进行相应金额的出借。</p>
                        <p>（2）甲方充分授权乙方委托资金存管合作银行、第三方支付机构进行网络借贷信息中介服务产品智能出借相关的代扣与划付指令，甲方知晓并授权乙方委托资金存管合作银行、第三方支付机构的代扣与划付资金并将通过乙方委托的资金存管合作银行、第三方合作机构开立的托管账户进行账户管理、资金往来记录及资金使用监督等。</p>
                        <p>2.乙方仅为甲方出借网络借贷交易、还款服务的居间人。</p>
                        <p>（1）乙方不对网络借贷交易相关协议的协议方的任何口头、书面陈述或者向乙方平台上传的线上信息之真实性、合法性做任何明示或暗示的担保；</p>
                        <p>（2）乙方不对相关金融机构及任何第三方的法定义务和/或契约责任承担任何连带责任；</p>
                        <p>（3）乙方不参加交易资金划转及支付环节之外的任何赔偿、纠纷处理等活动。</p>
                        <p>3.甲方理解并同意：</p>
                        <p>（1）乙方有权根据实际情况在提供具体资金代扣与划付辅助服务时决定扣款资金在渠道中的顺位，具体以页面提示或乙方网站的相关规则、解释为准；</p>
                        <p>（2）乙方有权视情形（包括但不限于汇添富基金对应的项目停售、发生较大出借风险等）单方中止/终止向甲方提供本协议约定的服务；</p>
                        <p>（3）乙方开展前述行动时将在乙方平台通知，而无需另行单独通知甲方，也不就该等行动给甲方造成的损失（包括但不限于丧失出借机会而未能取得出借收益）承担责任；</p>
                        <p>4.当收到网络借贷信息中介服务产品出借回款时，甲方不可撤销的授权乙方或乙方委托的资金存管合作银行、第三方支付机构根据甲方已收到的出借回款为限存入存钱罐账户。</p>
                        <p>（三）提现服务</p>
                        <p>1.甲方可以随时通过乙方平台发起提现申请，乙方按照甲方的需求提现至甲方在乙方平台注册时绑定的基本银行账户。</p>
                        <p>2.甲方申请提现时，应满足乙方公布的提现限额等要求。</p>
                        <p>3.提现的资金顺序为：甲方发起提现即不可撤销的授权乙方或乙方委托的资金存管合作银行、第三方支付机构，优先赎回甲方存钱罐货币基金，如金额不足，则转让甲方E起赚产品中资产。</p>
                        <p>4.甲方以E起赚资金申请提现即不可撤销地授权乙方将相应债权进行出让，并在出现满足条件的受让人后完成债权转让并提现。</p>
                        <p>5. 受让该E起赚产品的出借人，可能产生暂时垫付的不超过一期利息的资金，该垫付资金将在受让出借人收取该产品第一期利息时返还至受让人账户。</p>
                        <p>6.如因非乙方的其他任何原因，如银行操作失误、当事人操作失误、系统后台错误等等，致使甲方权益受损的，如未能按期到账、到账金额不符的，乙方不承担任何违约责任与赔偿责任。</p>
                        <p>（四）其他服务</p>
                        <p>1.优惠活动服务，乙方及乙方关联公司将不定期推出优惠活动，如甲方选择参与特定优惠活动，甲方同意并授权乙方基于本协议及特定优惠活动规则（包括相应服务说明、通知、协议条款等）代为操作，包括但不限于赎回甲方本人名下与其参与活动金额等额的存钱罐份额及/或转让等额的E起赚份额，具体优惠活动规则及授权内容以活动页面公布为准。</p>
                        <p>2.其他，乙方平台将基于业务拓展、战略合作等原因不定期推出新服务，如甲方使用特定新服务，甲方同意并授权乙方基于本协议及特定新服务规则（包括相应服务说明、通知、协议条款等）代为操作。</p>
                        <p>（五）其他说明</p>
                        <p>1.甲方使用各项服务，除遵守本协议与乙方平台的其他业务条款之外，还需同时遵守各项法律法规、各家银行的相关业务条款、各第三方业务说明。</p>
                        <p>2.甲方保证不为任何非法目的或以任何非法方式使用本协议约定的服务，并承诺遵守中华人民共和国相关法律法规和相关的互联网国际惯例。否则，乙方有权终止提供服务或撤销用户账户并依法追究用户的相应责任。</p>
                        <p>3.甲方应仅在乙方平台及乙方合作的资金存管银行及第三方平台享受各种服务，应尽到足够的注意义务，不轻信任意其他第三方网站、电子信息广告、网络链接等具有诈骗性、误导性、诱导性的虚假信息，乙方不对甲方做出的错误行为产生的后果承担责任。</p>
                        <p>4.未经签订其他协议确定或是另行约定，双方不得将本协议项下的权利义务转让给任何其他第三方，否则由过错方承担相应责任。</p>
                        <h3>四、收益与费用</h3>
                        <p>（一）甲方委托乙方进行出借服务获取的利息收益归甲方所有。乙方对受托出借的第三方金融产品收益不作任何承诺与保证，最终收益以甲方账户中实际到账金额为准。</p>
                        <p>（二）甲方知晓并授权乙方在提供服务时一并划扣网络借贷信息中介服务所需涉及的一切费用，并在乙方平台通知甲方相关费用的收付信息。</p>
                        <p>（三）甲方使用各项服务，乙方暂不收取除因双方各项约定费用之外的手续费，但保留收取费用的权利。</p>
                        <p>（四）如乙方确定或调整服务费用收取方式及标准，将以线上公告的方式通知甲方，相关规则一经公告即视为送达，甲方有权选择继续使用或终止相关服务。</p>
                        <h3>五、协议的变更及终止</h3>
                        <p>（一）在不损害甲方利益的前提下，乙方保留修改本协议内容的权利，修改后本协议在乙方“E都市钱包”APP上公示，甲方未提出异议或停止使用的，视为甲方同意该等修改。</p>
                        <p>（二）本协议签署后，若有关法律、法规、监管部门规章、及其他乙方和甲方应共同遵守的文件发生修订，本协议与之违背的内容及条款自行失效，但本协议其他内容和条款继续有效。</p>
                        <p>（三）本协在下述情况之一发生时终止：</p>
                        <p>1)甲方自行撤销账户；</p>
                        <p>2)乙方撤销甲方账户；</p>
                        <p>3)因不可抗力使本协议无法继续履行；</p>
                        <p>4)根据本协议约定或法律法规之规定，终止本服务的。</p>
                        <p>5) 因情势变更致使本协议难以继续旅行</p>
                        <h3>六、免责条款</h3>
                        <p>（一）如遇自然灾害等不可抗力事件，或其他不可预见的非常情况，或网络、通讯故障发生，或银行系统问题，以及其他乙方不可预测、不可控制的因素，导致乙方无法履行协议的，乙方将及时通知甲方，甲方须自行通过其他渠道解决，乙方不承担任何责任。</p>
                        <p>（二）如因甲方绑定的银行账户已销户或账户状态不正常（挂失、冻结）或者由于司法或其他原因而进行了账户冻结、扣划或销户，或因资金存管合作银行、第三方支付公司的原因导致乙方无法履行协议的，乙方不承担任何责任。</p>
                        <h3>七、违约责任</h3>
                        <p>本协议任何一方违反本协议规定的内容，给对方造成损害的，应当承担相应的违约责任，赔偿对方因此而造成的直接及间接损失，包括财产损失、名誉损失等。</p>
                        <h3>八、法律适用与争议解决</h3>
                        <p>本协议的成立、生效、履行和解释，均适用中华人民共和国法律。法律无明文规定的，应适用双方签订的其他协议、乙方相关的业务规定和通行的行业惯例。本协议履行过程中发生争议的，可由当事人协商解决。如果当事人不愿协商解决或协商不成的，任何一方均可向乙方所在地的杭州滨江区人民法院提起诉讼。</p>
                        <p>（以下无正文）</p>
                        <p style="margin:60px 0;padding-left:30px;">签订日期：&nbsp;&nbsp;
                            <span>{{year}}</span> 年
                            <span>{{month}}</span> 月
                            <span>{{day}}</span> 日</p>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    name: 'Investment',    // 登录框状态 
    data() {
        return {
            date: '',                // 当前的时间
            year: '',                // 当前的年份
            month: '',               // 当前的月份
            day: ''                  // 当前的日
        }
    },
    methods: {
        InvestmentFalg() {
            this.$emit('Investment', false);
        },
        initData() {
            this.date = new Date()
            this.year = this.date.getFullYear()
            this.month = this.date.getMonth() + 1
            this.day = this.date.getDate()
            if (this.month < 10) this.month = "0" + this.month
            if (this.day < 10) this.day = "0" + this.day
        }
    },
    mounted: function() {
        this.initData()
    },
}  
</script>

<style lang="scss">
#Investment {
    .bg {
        position: fixed;
        top: 0;
        right: 0;
        bottom: 0;
        left: 0;
        margin: auto;
        opacity: 0.6;
        background: #000;
        z-index: 100;
    }
    .xubox_layer {
        position: absolute;
        width: 820px;
        height: 600px;
        background-color: #fff;
        top: 0;
        left: 0;
        right: 0;
        bottom: 0;
        margin: auto;
        z-index: 200;
        border-radius: 5px;
        .title {
            width: 100%;
            height: 50px;
            border-radius: 5px;
            border-bottom: 1px solid #f2f2f2;
            background: #e7e7e7;
            font-size: 18px;
            line-height: 50px;
            padding-left: 20px;
            color: #ff6600;
            cursor: move;
            .del.reg {
                width: 50px;
                height: 50px;
                position: absolute;
                right: 0;
                top: 0;
                line-height: 50px;
                margin-right: 10px;
                cursor: pointer;
                text-align: center;
                color: #999;
                i.el-icon-close {
                    transition: transform .3s;
                }
            }
            .del:hover i.el-icon-close {
                transform: rotate(90deg);
            }
        }
        .xubox_page {
            padding: 10px;
            width: 100%;
            height: 550px;
            .content {
                padding: 0;
                line-height: 100px;
                overflow: hidden;
                overflow-y: auto;
                width: 100%;
                height: 530px;
                font-family: "Microsoft YaHei", "arial";
                h3 {
                    font-size: 14px;
                    font-weight: bold;
                    color: #666;
                    padding: 8px 10px 2px 10px;
                    line-height: 29px;
                }
                p {
                    line-height: 23px;
                    padding: 0 10px 2px 10px;
                    color: #666;
                    font-size: 14px;
                    text-align: justify;
                    span {
                        margin-left: 10px;
                    }
                }
            }
        }
    }
}
</style>