<template>
    <div id="services">
        <div class="agree">
            <router-link to="/home">
                <div class="a-header">
                <img src="https://aliyunsso.edspay.com/web/newIndex/logo_pc.png" alt="">
                </div>
            </router-link>
            <div class="conter">
                <h1>用户出借服务协议</h1>
                <span>协议编号：{{data.tenderNo ? 'fw'+data.tenderNo : "【 】"}}</span>
                <p>尊敬的客户：参考年化收益不代表实际收益，出借需谨慎，为了维护您的自身权益、防范出借风险，请在出借前仔细阅读本协议各条款，以及与{{data.productName ? data.productName : "【 】"}}定期出借计划（以下亦或简称"本计划"）相关的全部规则，以充分知悉、了解{{data.productName ? data.productName : "【 】"}}定期出借计划的出借规则、出借对象以及协议双方的权利、义务和责任。一旦加入本计划即视为对本协议全部条款及相关业务规则已充分理解并完全接受。</p>
                <p>在乙方充分了解并清楚知晓本产品出借风险的前提下,双方签订《用户出借服务协议》（以下简称"本协议"）：</p>
                <p>甲方：浙江楚橡信息科技有限公司 </p>
                <p>地址：浙江省杭州市滨江区江陵路2028号星耀城1期</p>
                <p></p>
                <p>乙方：{{data.userName ? data.userName : "【 】"}}</p>
                <p>联系电话：{{data.mobilePhone ? data.mobilePhone : "【 】"}}</p>
                <p></p>
                <p>甲乙双方经友好协商，本着平等自愿、诚实信用的原则，就{{data.productName ? data.productName : "【 】"}}定期出借计划的相关事项订立有效合约，达成如下协议：</p>
                <strong>一、定义：</strong>
                <p>除非本协议另有规定，以下词语在本协议中定义如下：</p>
                <p>1. E都市钱包平台：指由浙江楚橡信息科技有限公司开发并运营的，向乙方提供网络借贷信息交互、撮合、资信评估等居间服务的网络借贷信息中介服务平台。</p>
                <p>2. 乙方（出借人）：乙方是具有完全民事权利能力和民事行为能力，能独立行使和承担本协议项下权利义务的自然人，是甲方旗下的网站、手机客户端或微信公众号（以下统称为“E都市钱包”）的注册用户，愿意出借其合法取得的自有资金，并充分知晓民间借贷行为可能存在的各类风险。</p>
                <p>3. 合作机构：指与甲方建立合作关系的机构，包括但不限于第三方借款用户导流平台、第三方支付机构、资金存管银行等。</p>
                <p>4. 借款人：指有一定的借款需求，经过甲方或甲方合作机构推荐到本平台的、发起借款申请的，充分知晓民间借贷行为可能存在的各类风险的，具有完全民事权利能力和民事行为能力，能独立行使和承担本协议项下权利义务的自然人。</p>
                <p>5. 借款：出借人拟向借款人提供的出借资金。</p>
                <p>6. 平台账户：指出借人以自身名义在本平台注册后系统自动产生的虚拟账户或甲方为其在合作机构存管银行开立的资金存管账户，并可通过第三方支付机构或其他通道进行充值或提现。</p>
                <p>7. 借款合同及其相关协议：指出借人通过本平台完成撮合的借款所对应的借款合同及其配套协议（包括但不限于《用户出借服务协议》、《借款协议》、《债权转让协议》等）。</p>
                <p>8. 债权：指乙方通过向借款人出借本金而在借款合同及其相关协议项下享有的所有权利。</p>
                <p>9. 募集期：指E都市钱包平台上基于借款人需求发布的出借计划的资金募集期限，该期限以E都市钱包平台具体展示及记录为准。</p>
                <strong>一、主要内容</strong>
                <p>1.1 {{data.productName ? data.productName : "【 】"}}定期出借计划：是本平台推出的对借款项目（包括但不限于借款项目、债权转让项目等，下同）进行本金循环自动出借（包括但不限于将资金出借给借款人、将资金用于受让债权等，下同）、及项目期限届满时自动转让债权的出借计划，可通过系统实现分散量化出借。乙方期初出借本金以及获得的收益将在项目期限届满后通过授权甲方代为进行债权转让方式实现退出，退出资金将返还至乙方本平台账户。</p>
                <p>1.2期初出借本金数额：乙方期初出借本金为人民币{{data.amount ? data.amount : "【 】"}}元。</p>
                <p>1.3 期限：本次计划锁定期限为{{data.lockTime ? data.lockTime : "【 】"}}天。乙方知悉、了解并不可撤销地同意，自乙方在本次计划额度未届满前支付完毕加入资金的，即加入本次计划，且无论乙方加入本次计划时锁定期是否开始，一旦加入，乙方均不得撤销、取消本协议和/或撤销、取消加入本次计划，乙方加入本次计划的资金不能提现，并只能根据本协议第3.3款约定退出本次计划。乙方加入本次计划后，即可通过系统在本协议项下乙方认可的范围内进行优先自动出借。</p>
                <p>1.4 出借金额及参考收益：本次计划的参考年化收益率为{{data.planApr ? data.planApr : "【 】"}}%。乙方知悉、了解并不可撤销地同意，本协议项下涉及的任何收益均为参考收益，并不代表乙方最终实际收益，甲方未以任何方式对本金及参考收益进行承诺或担保，乙方出借本金存在不能够按期收回的风险，同时，在实际收益未达到参考收益的情况下，乙方仅能收取其期初出借本金数额所对应的实际收益。</p>
                <p>1.5 循环自动出借方式：乙方不可撤销地授权甲方通过E都市钱包自动为其匹配借款人，将其加入{{data.productName ? data.productName : "【 】"}}定期出借计划的资金出借给借款人，并在锁定期内将已投借款项目中到期回款的本金再次进行相同范围内的自动出借，直至本次计划锁定期结束。乙方知悉并同意，甲方通过E都市钱包自动为其匹配借款人进行资金出借的方式，可以是自动将乙方资金以匹配新的融资项目方式直接出借给借款人，也可以是自动为乙方自其它出借人处受让已有融资项目的债权，也可以是前述两种方式的结合。</p>
                <p>1.6 出借资金来源保证：乙方保证其所用于出借的资金为来源合法的自有资金，如果第三方对资金归属、合法性问题提出异议，由乙方自行解决。如未能解决，则乙方承诺放弃享有其所出借资金带来的利息等收益并自行承担因此造成的全部损失。</p>
                <strong>二、本协议的成立及生效</strong>
                <p>2.1 本协议成立：乙方按照本平台的规则，通过在本平台相关流程的跳转页面上勾选"我同意《用户出借服务协议》"以及点击"确认"按钮（具体按钮名称以本平台最新展示界面显示为准，下同）确认后，即视为乙方与甲方已达成本协议并同意接受本协议的全部约定以及本平台所包含的其他与本协议有关的各项规则的规定。</p>
                <p>2.2乙方点击"确认"按钮确认后，即视为乙方承诺：在本平台账户、第三方支付机构账户或存管银行账户中存入等同于本协议第1.2款所列的“期初出借本金”数额的资金，且乙方在本协议1.3款指定的锁定期内不再挪作其他用途。</p>
                <p>2.3 资金划转：</p>
                <p>2.3.1 本次计划所对应的出借本金全部加入完成，且甲方E都市钱包平台完成所有资金的自动出借后，根据本期{{data.productName ? data.productName : "【 】"}}定期出借计划所投特定项目的借款合同的相关约定，乙方及上述特定项目的借款人即不可撤销地授权甲方委托相应的第三方支付机构或银行等合作机构，将金额等同于本协议1.2款所列的"期初出借本金数额"的资金，逐笔按照借款合同所列的"借款本金数额"，划转至相应的借款人的指定银行账户，划转完毕即视为借款发放成功。</p>
                <p>2.3.2 甲方将在本期“E计划”定期出借计划所对应的出借本金完成加入后的1-3个自然日内完成本次计划资金的出借及划转。如3个自然日内未完成上述操作，则甲方将相应资金退回乙方的平台账户，资金加入至划转期间、资金加入至未完成退回期间退回期间不计收益。</p>
                <p>2.4 本协议生效：本协议于甲方完成本次计划所对应的资金划转当日立即生效，收益及相关费用自生效日次日开始计算。</p>
                <strong>三、出借及管理规则</strong>
                <p>3.1 乙方全权委托甲方按照本协议的约定，对等同于本协议1.2款所列的“期初出借本金”进行自动优先出借；同时，乙方授权甲方在完成上述自动优先出借后以乙方名义代为签署相应的借款协议及其相关协议。</p>
                <p>3.2 后续管理：在本次计划的存续期限内，乙方全权委托甲方对本次计划所出借的借款项目的后续回款进行如下处理，并以乙方名义代为签署相应的借款合同及其相关协议。</p>
                <p>3.2.1甲方将把本次计划所出借的借款项目返还的本金循环自动出借到其他借款项目中。</p>
                <p>3.2.2对于本次计划所出借借款项目产生的收益，甲方将根据第4.3款约定进行本金自动复投。</p>
                <p>3.3 在本次计划期限届满后，乙方全权委托甲方将乙方所持有的未到期的债权代为进行债权转让，并以乙方名义代为签署相应的《债权转让协议》等相关文件。</p>
                <p>3.4 本金及收益的返还时间：本次计划期限届满后1-3个自然日内（含3个自然日）。</p>
                <p>3.5 特殊处理方式：如本次计划期限届满后3个自然日后，甲方仍未能将乙方持有的本次计划中所对应的全部债权成功转让，则成功转让的债权所对应的资金，将显示在乙方平台账户中；未成功转让的债权在未转让期间正常计算收益，具体收益以借款协议展示利率为准，并将在债权转让成功后1-3个自然日内显示在乙方平台中。</p>
                <strong>四、收益及费用</strong>
                <p>4.1 收益来源：乙方委托甲方通过循环自动出借的方式将本金出借给本平台上的借款用户后，借款项目产生的利息在扣除管理服务费用后的剩余部分将作为本次计划的收益支付给乙方。</p>
                <p>4.2 收益起算时间：自本次计划出借资金自动出借成功后次日开始计算部分或全部收益。</p>
                <p>4.3 收益分配方式：本金自动复投、收益到期分配，即在{{data.productName ? data.productName : "【 】"}}定期出借计划存续期限内，乙方加入{{data.productName ? data.productName : "【 】"}}定期出借计划的期初出借本金将循环自动出借，完成的借款项目产生相应利息将在锁定期后显示在乙方平台账户中。</p>
                <p>4.4管理服务费用：若锁定期内借款项目产生的利息小于或等于相应目标值，则E都市钱包不向用户收取平台管理服务费；若该借款项目在锁定期内获取的利息大于参考收益，则超出参考部分为E都市钱包收取的管理服务费用，在锁定期结束返还本息时予以扣除。</p>
                <p>管理服务费用的计算公式=锁定期内产生的利息-出借参考收益（若计算结果小于或等于0时，管理服务费计为0）</p>
                <p>4.5利息管理费：乙方同意并授权甲方直接从本次{{data.productName ? data.productName : "【 】"}}定期出借计划的到期收益中收取{{data.interestManageFee ? data.interestManageFee : "3"}}%的利息管理费。</p>
                <strong>五、税费</strong>
                <p>乙方知悉和认可，因本协议项下的资金出借、债权转让过程中所产生的相关税费，应由乙方自行向其主管税务机关进行申报和缴纳，甲方不负责处理该等事宜。</p>
                <strong>六、本协议的修改及终止</strong>
                <p>6.1 本协议以电子文本形式生成，本协议的任何修改、补充均须以本平台电子文本形式作出。</p>
                <p>6.2 双方均确认，本协议的签订、生效和履行以不违反法律为前提。如果本协议中的任何一条或多条被司法部门认定为违反所须适用的法律，则该条将被视为无效，但该无效条款并不影响本协议其他条款的效力。</p>
                <p>6.3 乙方同意甲方有权根据国家法律法规、监管政策、自律规定、市场变化等对本协议及与本协议相关的规则进行调整，甚至终止本服务计划。</p>
                <p>6.4 调整或修改后的协议内容及相关业务规则将在本平台（包括但不限于官网公告、站内信、手机短信、邮件等方式）进行公布并立即生效，无需另行通知乙方。如果乙方不接受修改，可立即以退出本服务计划中全部出借本金的方式终止本服务；如乙方继续使用本服务计划即被视为接受修改，并受修改后的协议及相关业务规则约束。</p>
                <p>6.5 乙方同意，在甲方终止本协议时，乙方持有的本计划项下的借款项目将以借款协议的形式显示在乙方E都市钱包的出借详情中，乙方将按该借款项目的还款方式及债权转让协议的约定，获得相应的本金及利息回款。</p>
                <strong>七、其它</strong>
                <p>7.1 如双方在本协议履行过程中发生任何争议，应友好协商解决；如协商不成，则须提交甲方所在地人民法院诉讼解决。</p>
                <p>7.2 与本协议相关的其他具体操作规则以甲方网站、手机客户端或微信公众号展示为准，并作为本协议的附件，如具体规则与本协议不一致的，以具体规则为准。乙方同意本协议即视为同意本协议相关附件。</p>
                <div class="Inscribe">
                    签署日期：{{data.date ? data.date : "【 】年【 】月【 】日"}}
                    <img :src="'data:image/jpg;base64,' + data.edspaySingImg" alt="">
                </div>
            </div>

            <div class="conter">
                <h1 style="padding-top: 220px;">补充协议</h1>
                <span>协议编号：{{data.addId ? data.addId : "【 】"}}</span>

                <p>甲方：浙江楚橡信息科技有限公司 </p>
                <p>地址：浙江省杭州市滨江区江陵路2028号星耀城1期</p>
                <p></p>
                <p>乙方：{{data.userName ? data.userName : "【 】"}}</p>
                <p>联系电话：{{data.mobilePhone ? data.mobilePhone : "【 】"}}</p>
                <p></p>
                <p>甲乙双方经友好协商，本着平等自愿、诚实信用的原则，就乙方将其所认购持有的{{data.productName ? data.productName : "【 】"}}定期出借计划向甲方转让的相关事宜订立有效合约，达成如下协议：</p>
                <strong>定义：</strong>
                <p>除非本协议另有规定，以下词语在本协议中定义如下：</p>
                <p>1.E都市钱包平台：指由浙江楚橡信息科技有限公司开发并运营的，向乙方提供网络借贷信息交互、撮合、资信评估等居间服务的网络借贷信息中介服务平台。</p>
                <p>2.乙方（出借人）：乙方是具有完全民事权利能力和民事行为能力，能独立行使和承担本协议项下权利义务的自然人，是甲方旗下的网站、手机客户端或微信公众号（以下统称为“E都市钱包”）的注册用户且已认购持有定期出借计划。</p>
                <p>3.合作机构：指与甲方建立合作关系的机构，包括但不限于第三方支付机构、资金存管银行等。</p>
                <p>4.平台账户：指出借人以自身名义在本平台注册后系统自动产生的虚拟账户或甲方为其在合作机构存管银行开立的资金存管账户，并可通过第三方支付机构或其他通道进行充值或提现。</p>
                <strong>一、主要内容</strong>
                <p>1.1乙方不可撤销地将其在E都市钱包平台所认购持有的全部的定期出借计划一次性转让给甲方，由甲方受让该定期出借计划项下匹配的相关债权及权益，并由甲方自行负责相关债权的贷后管理工作并承担相关的逾期或坏账。上述相应转让对价以乙方实际提现金额为准。</p>
                <p>1.2甲方通过其在存管银行开设的银行专户，将上述转让款项划拨至乙方平台账户。乙方应在15日内将平台账户中的余额手动提现至其绑定的银行卡内。自乙方发起提现申请后，即视为认可本补充协议全部内容，以及同意该提现金额为转让对价。</p>
                <p>1.3自甲方将转让款项划拨至乙方平台账户后，乙方即不再对甲方及定期出借计划项下债权享有任何权利或权益，乙方不得以任何名义向甲方或定期出借计划项下的债务人主张任何权利或追究任何法律责任。</p>
                <strong>二、费用及税费</strong>
                <p>2.1乙方知悉并认可，因乙方提现、转账等产生的手续费（由银行、第三方支付机构或合作机构收取）应由乙方自行承担。</p>
                <p>2.2乙方知悉并认可，因本协议项下的项目转让过程中所产生的相关税费，应由乙方自行向其主管税务机关进行申报和缴纳，甲方不负责处理该等事宜。</p>
                <strong>三、其它</strong>
                <p>3.1如双方在本协议履行过程中发生任何争议，应友好协商解决；如协商不成，则须提交甲方所在地人民法院诉讼解决。</p>
                <p>3.2与本协议相关的其他具体操作规则以甲方网站、手机客户端或微信公众号展示为准，并作为本协议的附件，如具体规则与本协议不一致的，以具体规则为准。乙方同意本协议即视为同意本协议相关附件。</p>

                <p style="padding-top: 20px;">甲方：浙江楚橡信息科技有限公司 </p>

                <p>乙方：<img class="signImg" style="height: 60px;" :src="'data:image/jpg;base64,' + data.signImg" alt=""></p>


                
                <div class="Inscribe">
                    签署日期：{{data.date ? data.date : "【 】年【 】月【 】日"}}
                    <img :src="'data:image/jpg;base64,' + data.edspaySingImg" alt="">
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                data:{
                    amount:'',
                    lockTime:'',
                    mobilePhone:'',
                    planApr:'',
                    productName:'',
                    tenderNo:'',
                    userName:''
                },
                tokenS:''
            }
        },
        methods: {
            // 初始化信息
            getInfo () {
                let tenderId = ''
                let json={}
                this.getCookie('token') ? this.tokenS = this.getCookie('token') : this.tokenS = ''
                if(this.$route.query.tenderId){
                    json={
                        token:this.tokenS,
                        planId:this.$route.query.planId,
                        tenderId:this.$route.query.tenderId
                    }
                }else{
                    json={
                        token:this.tokenS,
                        planId:this.$route.query.planId
                    }  
                }
                global.http._post(this,"/protocol/p2p/serviceProtocol",json,data => {
                    this.data = data.body.resData
                })
            },
        },
        created: function() {
            this.getInfo()
        },
        mounted: function() {

        },
        components: {

        }
   }
</script>

<style lang="scss" scoped>
    #services{
        background: #fff;
        position: absolute;
        top: 0;
        left: 0;
        bottom: 0;
        right: 0;
        margin: auto;
        z-index: 99;
        .agree{
            width: 1200px;
            height: auto;
            margin: 0 auto;
            background: #fff;
            border-left: 1px solid #e2e2e2;
            border-right: 1px solid #e2e2e2; 
            padding: 0 40px 100px 40px; 
            text-align: justify;
            .a-header{
                position: relative;
                height: 83px;
                padding: 20px 0 0 30px;
                border-bottom: 1px solid #e2e2e2;
                cursor: pointer;
                img{
                    width: 210px;
                    height: 43px;
                }
            }  
            .conter{
                position: relative;
                font-size: 14px;
                line-height: 19px;
                padding: 0 80px;
                h1{
                    margin-bottom: 25px;
                    color: #555555;
                    font-size: 25px;
                    margin-top: 35px;
                    text-align: center;
                    font-weight: bold;
                }
                span{
                    display: block;
                    width: 100%;
                    height: 19px;
                    font-size: 14px;
                    text-align: right;
                    margin-bottom: 30px;
                }
                p, strong{
                    margin-bottom: 5px;
                    min-height: 19px;
                }
                strong{
                    font-size: 16px;
                    display: block;
                }
                .Inscribe{
                    width: 500px;
                    line-height: 22px;
                    font-size: 16px;
                    margin: 80px 0px 40px 700px;
                    padding-right: 50px;
                    position: relative;
                    img{
                        height: 100px;
                        width: 100px;
                        position: absolute;
                        top: -55px;
                        left: 83px;
                    }
                    p{
                        margin-bottom: 20px;
                    }
                }
            }   
        }
    }
</style>
